WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/specialized/meadow_calc_freq_dc.c
  meadow_calc_freq_dc_enable(timerBase);

  return OK;
}

//================================================================
// Return Frequency and Duty Cycle infomation to mono
int meadow_calc_freq_dc_mono_freq_duty_cycle(struct freqDcReturnData_s *returnData)
{
  // These insure that once a valid value is found, a change in the timer's
  // data structure won't affect the output.
  uint32_t fullPeriod;
  uint32_t validCheckCount = 0;
  uint32_t partPeriod;
  struct freqDcData_s *freqDcData;

  // Use timer number to find the information to return
  struct freqDcTimerInfo_s *freqDcTimerInfo = meadow_calc_freq_dc_get_timer_info_pointer(returnData->timerNumber);
  if(freqDcTimerInfo == NULL)
  {
    return -ENXIO;      // Unsupported timer for this feature
  }

  // Is there an object here?
  if(freqDcTimerInfo->dataPtr == NULL)
  {
    return -ENODATA;      // No timer initialized
  }

  freqDcData = (struct freqDcData_s *)freqDcTimerInfo->dataPtr;

  // Find valid data. This is only an issue at higher frequencies.
  for(validCheckCount = 0;\
      validCheckCount < MEADOW_FREQ_DC_READ_GOOD_DATA_ATTEMPTS;
      validCheckCount++)
  {
    fullPeriod = freqDcData->timerFullPeriod;
    partPeriod = freqDcData->timerPartPeriod;

    if(fullPeriod > 0 && partPeriod > 0)
      break;      // Located valid data

    usleep(2 * 1000);   // delay 1-2 ms waiting for better data
  }

  if(fullPeriod > 0 && partPeriod > 0)
  {
    // Do floating point math for initial calculations to get good resolution.
    double dutyCycle = (double)(partPeriod * 100.0) / (double)fullPeriod;
    double freq = (double)(MEADOW_FREQ_DC_CLOCK_FREQ)/ \
              (double)fullPeriod;

    // Multiply by 1000 and convert to uint32_t for return.
    returnData->dataField1 = (uint32_t)(freq * 1000.0);
    returnData->dataField2 = (uint32_t)(dutyCycle * 1000.0);
  }
  else
  {
    // Return 0s as no data available
    returnData->dataField1 = 0;
    returnData->dataField2 = 0;
  }

  // Prevent this count from being used when there's no input.
  freqDcData->timerFullPeriod = 0;
  freqDcData->timerPartPeriod = 0;

  return OK;
}

#endif    // #if defined(MEADOW_INCLUDE_CALC_FREQ_DC_IN_BUILD)
